app/Containers/NewsSection/News/Data/Repositories/NewsRepository.php

    public function createNews(array $data): News
    {
        $news = new News();
        $news->title = $data['title'];
        $news->slug = $data['slug'];
        $news->user_id = $data['user_id'];
        $news->thumbnail = $data['thumbnail'];
        $news->content = $data['content'];
        $news->publish_at = $data['publish_at'];
        $news->save();
---
insert into `news` (`title`, `slug`, `user_id`, `thumbnail`, `content`, `publish_at`, `updated_at`, `created_at`) values ('Kampret', 'kampret', 1, 'https://placehold.co/600x400', 'dsdsdsdsd', '2024-02-15', '2024-02-15 12:21:35', '2024-02-15 12:21:35')

    public function findNewsById($id): News
    {
        $news = News::where('id', $id)->first();
        if (!$news->views) {
            DB::table('news_views')->insert(['news_id' => $id, 'views' => 1]);
        }

        DB::table('news_views')->where('news_id', $id)->increment('views');
---
update `news` set `title` = 'ok', `news`.`updated_at` = '2024-02-15 12:09:17' where `id` = 4 and `news`.`deleted_at` is null

    public function updateNewsById(array $data, $id): News
    {
        $news = tap(News::where('id', $id))->update([
            'title' => $data['title'],
            'slug' => $data['slug'],
            'user_id' => $data['user_id'],
            'thumbnail' => $data['thumbnail'],
            'content' => $data['content'],
            'publish_at' => $data['publish_at'],
        ])->first();
---
update `news` set `title` = 'Kampret edit', `slug` = 'kampret-edit', `user_id` = 1, `thumbnail` = 'https://placehold.co/600x400', `content` = 'dsdsd', `publish_at` = '2024-02-15', `news`.`updated_at` = '2024-02-15 12:22:08' where `id` = 5 and `news`.`deleted_at` is null
select * from `news` where `id` = 5 and `news`.`deleted_at` is null limit 1